; ---
; Программа вычисления произведения аргументов командной строки
; ---

%include 'in_out.asm'

SECTION .data
msg db "Результат: ",0

SECTION .text
global _start

_start:
    pop ecx         ; Извлекаем из стека в `ecx` количество аргументов
    pop edx         ; Извлекаем из стека в `edx` имя программы
    sub ecx,1       ; Уменьшаем `ecx` на 1 (количество аргументов без названия программы)
    mov esi, 1      ; Используем `esi` для хранения произведения (начальное значение 1)

next:
    cmp ecx,0h      ; проверяем, есть ли еще аргументы
    jz _end         ; если аргументов нет, выходим из цикла
    pop eax         ; иначе извлекаем следующий аргумент из стека
    call atoi       ; преобразуем символ в число
    imul esi, eax   ; умножаем промежуточное произведение на аргумент `esi = esi * eax`
    loop next       ; переход к обработке следующего аргумента

_end:
    mov eax, msg    ; вывод сообщения "Результат: "
    call sprint
    mov eax, esi    ; записываем произведение в регистр `eax`
    call iprintLF   ; печать результата
    call quit       ; завершение программы
